In [4]:
pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\lib\site-packages (2.0.30)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pymysql in c:\programdata\anaconda3\lib\site-packages (1.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [5]:
# Import necessary libraries
from sqlalchemy import create_engine
import pandas as pd

# Database connection details
db_user = 'root'  # Replace with your MySQL username
db_password = ''  # Replace with your MySQL password
db_host = '127.0.0.1'  # Localhost
db_name = 'sakila'  # Correct database name, without the tab

# Create the connection URL
connection_url = f"mysql+pymysql://{db_user}:{db_password}@{db_host}/{db_name}"

# Create an SQLAlchemy engine
engine = create_engine(connection_url)

# Query the database
query = "SELECT * FROM address;"  # Replace 'address' with the appropriate table if needed

# Read the query results into a pandas DataFrame

df = pd.read_sql(query, engine)

# Display the DataFrame
print(df.head())

# Close the connection
engine.dispose()

   address_id               address address2  district  city_id postal_code  \
0           1     47 MySakila Drive     None   Alberta      300
1           2    28 MySQL Boulevard     None       QLD      576
2           3     23 Workhaven Lane     None   Alberta      300
3           4  1411 Lillydale Drive     None       QLD      576
4           5        1913 Hanoi Way           Nagasaki      463       35200

         phone         last_update
0              2014-09-25 22:30:27
1              2014-09-25 22:30:09
2  14033335568 2014-09-25 22:30:27
3   6172235589 2014-09-25 22:30:09
4  28303384290 2014-09-25 22:31:53

In [3]:
df.describe()

       address_id     city_id                    last_update
count  603.000000  603.000000                            603
mean   302.719735  300.525705  2014-09-25 22:31:57.502487808
min      1.000000    1.000000            2014-09-25 22:29:59
25%    151.500000  150.500000            2014-09-25 22:30:56
50%    303.000000  300.000000            2014-09-25 22:31:53
75%    453.500000  450.500000     2014-09-25 22:32:56.500000
max    605.000000  600.000000            2014-09-25 22:34:11
std    174.853150  173.600949                            NaN